{
 "articles": [
    {
       "title": "Your Organization's Backup Strategy",
       "body": "Your Organization's Backup Strategy Is your organization prepared for a disaster? A solid backup strategy is one of the key elements of being prepared. Get started developing your organization's backup strategy with these tips and best practices. Editor's note:This article was originally excerpted from TechSoup's The ResilientOrganization: A Guide for Disaster Planning and Recovery, which contains more resources on developing backup systems, strategies, and tools for your organization. This article was updated in 2012 by Ariel Gilbert-Knight. Regular backups are vital insurance against a data-loss catastrophe. In this article, we'll offer some best practices and basic strategies for backup. Be sure to also read our follow-up article on implementing your organization's backup strategy. Saving Time by Spending Time Developing a solid backup plan requires an investment of time and money, but the cost is far less than the burdensome task of recreating data for which no backup exists. Susan at the Eagle's Nest Foundation (ENF) is no stranger to IT disasters. ENF's remote campsite frequently deals with power and Internet failures. Susan had this to say about regular backups: It's better to 'waste' the time backing up than to dread the effects of a disaster that could happen any time. Redundancy in communication options is very important, as is having off-site resources for communication when your systems are down. We have two offices in different parts of the state. This gives us an excellent natural backup strategy. Understanding On-Premise and Remote Backup There are two broadly defined approaches to backup: on-premise backup and remote backup. Either route (or both) may be appropriate for your nonprofit. On-premise backup In an on-premise setup, you can copy your data to a second hard drive, other media, or a shared drive, either manually or at specified intervals. With this setup, all the data is within your reach — and therein lies both its value and its risk. You can always access your information when necessary, but that information is vulnerable to loss, whether through theft (someone breaking in and stealing equipment) or damage (such as a leaky water pipe or a natural disaster). Remote backup In remote backup, your computer automatically sends your data to a remote center at specified intervals. To perform a backup, you simply install the software on every computer containing data you want to back up, set up a backup schedule, and identify the files and folders to be copied. The software then takes care of backing up the data for you. With remote backup solutions, you don't incur the expense of purchasing backup equipment, and in the event of a disaster you can still recover critical data. This makes remote backup ideal for small nonprofits (say, 2 to 10 people) that need to back up critical information such as donor lists, fundraising campaign documents, and financial data, but lack the equipment, expertise, or inclination to set up dedicated on-site storage. Automation is another key benefit to remote backup. A software program won't forget to make an extra copy of a critical folder; a harried employee at the end of a busy week might. By taking the backup task out of your users' hands you avoid the I forgot problem. The main downside to remote backup solutions is that Internet access is required to fully restore your backed-up data. If your Internet connection goes down (as may happen in a disaster scenario), you won't be able to restore from your backups until your Internet connection is restored. Another potential downside is that you have to entrust critical data to a third party. So make sure you choose a provider that is reliable, stable, and secure. You can also help secure your data by encrypting it before it is transmitted to the remote backup center. Understanding Types of Backup With most backup solutions you can choose to back up all of your data (a full backup) or just parts of your data (an incremental or differential backup). A full backup is the most complete type of backup. It is more time-consuming and requires more storage space than other backup options. An incremental backup only backs up files that have been changed or newly created since the last incremental backup. This is faster than a full backup and requires less storage space. However, in order to completely restore all your files, you'll need to have all incremental backups available. And in order to find a specific file, you may need to search through several incremental backups. A differential backup also backs up a subset of your data, like an incremental backup. But a differential backup only backs up the files that have been changed or newly created since the last full backup. All backup routines must balance expense and effort against risk. Few backup methods are 100-percent airtight — and those that are may be more trouble to implement than they're worth. That said, here are some rules of thumb to guide you in developing a solid backup strategy: Plan your backup strategy. Develop a written backup plan that tells you: What's being backed up Where it's being backed up How often backups will occur Who's in charge of performing backups Who's in charge of monitoring the success of these backups Think beyond just your office and its computers. Of course you should back up the data on all of the desktops, laptops, and servers in your office. But what about data stored on staff members' home computers? Or on mobile devices? Is your website backed up? What kind of data is your organization storing in the cloud? How is your email backed up? For more information on identifying what information to back up, see the companion article, Implementing Your Organization's Backup Strategy. Also consider data you currently store only in hard copy, as this kind of data is not easily reproducible. For example: Government forms, such as 501(c)(3) paperwork Financial information HR information Contracts Leases This type of information should be stored in a waterproof safe or file cabinet as well as backed up electronically (either scanned or computer-generated). Give highest priority to crucial data. Each organization needs to decide how much work it is willing to risk losing and set its backup schedule accordingly. Database and accounting files are your most critical data assets. They should be backed up before and after any significant use. For most organizations, this means backing up these files daily. Nonprofits that do a lot of data entry should consider backing up their databases after each major data-entry session. Core files like documents (such as your Documents folders) and email files should be backed up at least once a week, or even once a day. It's not usually necessary to back up the complete contents of each individual computer's hard drive — most of that space is taken up by the operating system and program files, which you can easily reload from a CD if necessary. Storing and protecting your backups. For on-premise backup solutions, we recommend rotating a set of backups off-site once a week. Ideally, you should store your backups in a secure location, such as a safe deposit box. Another method is to follow the 2x2x2 rule: two sets of backups held by two people at two different locations. Especially if your area is susceptible to natural disasters, think about going a step further. You need to make sure your local and remote backup solutions won't be hit by the same disaster that damages your office. For example, in the wake of Hurricane Ike, one organization we spoke with had displaced staff working remotely in four different cities. One staff person reminded us that if you're storing your backups in the same city as your office computers, there's a danger that one catastrophe will destroy both: Consider your entire city a potential point of failure! Similarly, when TechSoup relocated our datacenter in 2011, we made sure to select a site that was located in a different earthquake zone from our main offices. Although it may sound overly cautious, you will be glad to have a system like this in place should disaster strike. Think about how you will access critical data and files Consider what data would be most essential to have at your fingertips in an unexpected scenario. If you lose Internet connectivity, online services will be unavailable. What information or files would be key as you wait to regain Internet connectivity (which will enable you to restore from an offsite backup)? Where will you store those files? Test your backups before you need them Make sure your backup software has full read-back verification. Design a recovery plan, and try restoring a few files to a different computer at a different location so you can test your plan before you actually need it. Now that you know the basics of backup, continue to our companion article, Implementing Your Organization's Backup Strategy."
    },
    { 
       "title": "7 Backup Strategies for Your Data, Multimedia, and System Files",
       "body": "Your hard drive might crash. Thieves might steal your laptop at a café. You might realize on Friday that you desperately need the now-departed Wednesday version of an important document that you significantly altered on Thursday. At times like these, having a secure, up-to-date backup of your hard drive can be a lifesaver. Here are seven practical strategies, including using USB storage, backing up via the Internet or through your local network, backing up Windows itself, and preserving huge media files like songs and videos. What to Back Up Your hard drive may contain hundreds of thousands of files. Many of them should be backed up every day, others only oc­­casionally, and still others--including temp files, the hibernation file (hiberfil.sys), and your browser cache--not at all. Let's look at the different kinds of files individually. Your documents: You should back up your word processing files, spreadsheets, and similar documents every day. Any basic backup program can perform incremental backups, in which the program copies only the files that have changed since the most recent previous backup. (Good backup programs also perform versioning; that is, they keep several iterations of the same file on hand and enable you to choose which version to restore.) Your recent documents: If your backup program can handle incremental backups, you don't have to worry about recent documents as separate entities. But if you often work on these files on other people's computers, you may want to carry a copy of them on a flash drive or store a copy of them online. Application data: Apps create and maintain data files such as e-mail messages, browser favorites, calendar entries, and contacts that require daily backing up. Most programs store them in a hidden folder inside your user folder (in XP, C:\Documents and Settings\your name\Application Data; in Vista, C:\Users\your name\AppData). Also, in XP, Microsoft stores Outlook and Outlook Express data in C:\Documents and Settings\your name\Local Settings\Application Data). Fortunately, any well-designed backup program intended for everyday, nonexpert users (as opposed to IT departments) knows where to look for Outlook data. Media: If your backup medium is sufficiently roomy and fast, you can back up your photo, music, and video files every day. But these large files may require a separate backup strategy. Heirlooms: Files that you want to keep forever--family photos, the special anniversary card you made for your parents, and so on--need backing up and extra protection. Your system: You can always reinstall Windows and your apps, if you have the original discs or can download the programs. But if Windows becomes unusable or your hard drive crashes, switching to a system backup (also called a disaster recovery backup) that you create a couple of times a year can get your machine up and running smoothly without much effort. You can separate and store various types of data on different hard drives (or partitions--see Move Your Data to a Safer, Separate Partition, Part 1: XP and Move Your Data to a Safer, Separate Partition, Part 2: Vista). But Windows doesn't make the procedure easy, and the strategies I discuss don't require this separation."
    },
    { 
       "title": "Why backups are important",
       "body": "A few days ago, my smartphone froze and refused to restart even after a hard reboot that involved removing the battery. I had to send the thing for maintenance, and as expected, it came back wiped clean. For a minute I imagined how I would feel if all my contacts, notes and photos were lost. This would have been devastating. However, I soon remembered that I had performed a backup two weeks earlier and that although I probably lost some data, I did not lose it all. Computer systems have not only become an integral part of our daily life, but they have also become the primary method for most organizations to process and store data. For those organizations, protecting data and systems is essential because failures and losses may be very costly. In the case of a disaster, the difference between survival and closure is the ability to recover since the disaster may lead to loss of business, low productivity or legal actions, and not to mention, the cost of re-creating data. Yet despite the obvious benefits, we often neglect performing regular backups. Even worse, the majority of those who do take backups neglect to test them regularly to make sure that they are usable if needed. Having an untested backup will give a false sense of security that may lead to disaster. RAID is not backup: If you store your important data (like honeymoon photos) on a hard disk drive and it fails, you may lose them all. Putting your data on a Redundant Array of Independent Disks (RAID) can protect against a disk failure, which is a good and important thing to do. However, RAID is not really a backup because if someone deletes those folders by mistake, they will be removed from all disks in your array. If you do not have a backup you may not be able to get them back. Putting your backups on another hard drive inside your system may also seem like a good idea, because if you lose the active data you will have another copy to restore from. However, if a virus corrupts your data, having your backup online inside the system makes it vulnerable. So you’d better have it somewhere else, but where? Choose carefully where to store your backups: A USB flash disk loses data with time if left on the shelf. They say that it takes up to 10 years, but I lost some info off of a USB after less than 5 years. In addition, UFDs are easy to lose altogether. My mother has lost a couple of those that had important data backed up to them. Although optical disks tend to live twice as long, a friend of mine who was storing his in an unhealthy storage room showed me fungi eating a few of his younger CDs. After all, they are made of organic material and putting them in a moist, dark, warm place is a sure way to speed up the process of deterioration. Tape, on the other hand, can live longer, can store a large volume of data and is removable. This makes it ideal for offsite backups and the ideal choice to back up your organization’s data. I personally have a NAS device on my network, but away from my PC, to store backups. It may not have as much space as I would like, but it offers me the possibility to schedule online backups and perform fast restores if needed. Storing your backups away from your live system is very important for disaster recovery since a fire, for example, can destroy your backup along with your active data if you were storing both in the same room! Offsite backup options need to be considered for all businesses. Even if you cannot ship your backups offsite, try at least to store them in another room in the building. Backup Strategy: The first step in putting a sound backup strategy is to understand your system requirements. Make sure to understand what needs to be backed up and how often you need to back it up. Recovery point objective (RPO), which describes how much data lose is tolerable in case of major incident, is an important thing to consider as it dictates how often you need to perform a backup and how often you need to ship them offsite. This, in addition to the amount of data you need to backup, will determine the size of your backups. In light of your requirements, you can select the backup method most appropriate to satisfy them. You need to consider both hardware and software. Usability, scalability, compatibility, support and centralized administration are all important aspects to take into account when selecting the right backup methods for your needs. You also need to have a documented backup policy describing how often to back up your data and what exactly to back up. The backup policy depends on the importance of the information and the acceptable risk to the data owner. A simple backup policy usually revolves around one of the following backup types: Full Backup, which as the name implies takes a backup of all data. Since all data is being backed up together this means that restoring it will be much easier, however this also means that it may take a long time to execute and the data taken each time may not be very different from the backups taken previously, as most files rarely change.  Yet the major disadvantage of full backups is that because they are relatively large, they tend to take a long time to perform. This makes performing them often impractical and you will have considerable gaps between full backups taken. Those gaps are generally filled by one of the following two methods. Differential backup only takes a backup of what has been changed since the last full backup. This means that if you take a full backup on Sunday, on Monday you only need to backup the data that changed during Monday. Similarly, on Tuesday, you will have to take a backup of data changed in both Monday and Tuesday. Same on Wednesday. When restoring a file that is lost on Thursday, you need the full backup taken on Sunday and the differential backup taken on Wednesday. This can be a good compromise, but the size of differential backup will increase each day during the cycle until the cycle is restarted by taken another full backup. Incremental backup is a bit different from differential backup in that only changes made that day are backed up. Like with differential, if you take a full backup on Sunday, on Monday you only need to backup the data that changed during Monday. However in contrast with a differential backup, on Tuesday you only need to backup the data changed on Tuesday and on Wednesday you only need to backup the data changed on Wednesday … etc. This has the obvious advantage of reducing the size of the backup taken each day and the time needed to take it. However, the price you have to pay is that if you need to restore a file lost on Thursday, you will need, in addition to the full backup taken on Sunday, the incremental backups taken on Saturday, Monday, Tuesday and Wednesday. Types of Backups Now that we have our backups, are we done? Unfortunately, many in the industry tend to think so, or at least act as if they think so. There’s more to this behavior than simple laziness. Many admins tend to provide support in a fire fighting mentality and believe in crossing a bridge when reaching it. They may justify that by saying “If it is not broken, do not fix it” since restoring backups just to test them can be a daunting task that requires time and resources. However, a good backup strategy must also include the following three important best practices. Test your backups: There is a myth that wiser older admins tell younger admins that goes like this: Once upon a time, an admin convinced his management to invest in a backup strategy. He bought the tapes, the tape drive and put a backup schedule. He followed the schedule strictly and he even took the tapes with him each day to store at his home safe vault where he felt that they would be secure offsite if anything happened. One day something broke and he was eager to show his management the benefit of the backups he had been performing for so long. He got the most recent tape, but he found nothing on it. He got the previous one and there was nothing there. Actually, none of his backups had any usable data! It turned out that his vault was using a magnetic lock that had been erasing his tapes all this time. Although, I seriously doubt that this has actually happened, the moral of the story is that if he had tested his backups much earlier, he would have caught this unexpected effect and he would have known not to put those backups in his “tape-eraser,” thinking that they would be safer and more secure there. A more realistic scenario I’ve seen happen often is people failing to take backup to all the needed folders or not knowing what to do when the time comes to restore it. This also can be limited by testing the backups as you need to be prepared to restore the data. Rehearse your restore procedure: When something wrong happens to your data or systems, you will be under great pressure to restore it as soon as possible. Do not put yourself in a position where you do not know how to do it right. Making sure recovery steps are documented and making sure that everything will work as it should after you perform them is a key to any good backup strategy. Performing a test restore regularly not only ensures that you can pull it up when needed; but it also ensures that the backups themselves are functional. I knew an admin once that was responsible for his enterprise website. He had automated jobs setup by the vendor to take the needed backups 4 times a day. One day, he needed to restore the website after a catastrophic loss, but he did not know what needed to be done so he called the vendor. Only then did he find out that he needed to install MySQL, PHP and a number of third party tools and configure them before restoring the backup. Once that was done, he had to rebuild the site; The PHP rebuild alone took more than an hour to complete. For a large enterprise that sells online, losing its website for seven hours was unthinkable, and resulted in the admin choosing a different profession! Do not build your strategy around one person: Best practice also dictates letting someone other than the one who wrote the restore procedure test it. An ideal candidate to test procedure is a person that has the needed IT skills but is not directly involved with the system. If you are the only one that can do it, then you have not documented it well. Also, keep in mind that we all tend to do some steps by default, and more often than not, those steps tend to be neglected when writing procedures. The problem with that is that someone else following the documents may not be able to predict the steps that seem so second nature to you. Even worse, sometime later you may change your habits and find it hard to follow the procedure that you once were able to. I am sure that no admin likes to be dragged to the office from a vacation whenever a restore is needed. I am also sure that no employer likes the idea of business survival depending on one person being available 24/7, 365 days a year. So make sure that all IT procedures are well documented; restore procedures are not an exception. Want to improve your IT skills? Sign up for a 3-day free trial to access TrainSignal’s entire training library."
    },
    { 
       "title": "Backup and Restore with Filesystem Snapshots",
       "body": "Backup and Restore with Filesystem Snapshots This document describes a procedure for creating backups of MongoDB systems using system-level tools, such as LVM or storage appliance, as well as the corresponding restoration strategies. These filesystem snapshots, or “block-level” backup methods use system level tools to create copies of the device that holds MongoDB’s data files. These methods complete quickly and work reliably, but require more system configuration outside of MongoDB. See also MongoDB Backup Methods and Back Up and Restore with MongoDB Tools. Snapshots Overview Snapshots work by creating pointers between the live data and a special snapshot volume. These pointers are theoretically equivalent to “hard links.” As the working data diverges from the snapshot, the snapshot process uses a copy-on-write strategy. As a result the snapshot only stores modified data. After making the snapshot, you mount the snapshot image on your file system and copy data from the snapshot. The resulting backup contains a full copy of all data. Snapshots have the following limitations: The database must be valid when the snapshot takes place. This means that all writes accepted by the database need to be fully written to disk: either to the journal or to data files. If all writes are not on disk when the backup occurs, the backup will not reflect these changes. If writes are in progress when the backup occurs, the data files will reflect an inconsistent state. With journaling all data-file states resulting from in-progress writes are recoverable; without journaling you must flush all pending writes to disk before running the backup operation and must ensure that no writes occur during the entire backup procedure. If you do use journaling, the journal must reside on the same volume as the data. Snapshots create an image of an entire disk image. Unless you need to back up your entire system, consider isolating your MongoDB data files, journal (if applicable), and configuration on one logical disk that doesn’t contain any other data. Alternately, store all MongoDB data files on a dedicated device so that you can make backups without duplicating extraneous data. Ensure that you copy data from snapshots and onto other systems to ensure that data is safe from site failures. Although different snapshots methods provide different capability, the LVM method outlined below does not provide any capacity for capturing incremental backups. Snapshots With Journaling If your mongod instance has journaling enabled, then you can use any kind of file system or volume/block level snapshot tool to create backups. If you manage your own infrastructure on a Linux-based system, configure your system with LVM to provide your disk packages and provide snapshot capability. You can also use LVM-based setups within a cloud/virtualized environment. Running LVM provides additional flexibility and enables the possibility of using snapshots to back up MongoDB. Snapshots with Amazon EBS in a RAID 10 Configuration If your deployment depends on Amazon’s Elastic Block Storage (EBS) with RAID configured within your instance, it is impossible to get a consistent state across all disks using the platform’s snapshot tool. As an alternative, you can do one of the following: Flush all writes to disk and create a write lock to ensure consistent state during the backup process. If you choose this option see Create Backups on Instances that do not have Journaling Enabled. Configure LVM to run and hold your MongoDB data files on top of the RAID within your system. If you choose this option, perform the LVM backup operation described in Create a Snapshot. Backup and Restore Using LVM on a Linux System This section provides an overview of a simple backup process using LVM on a Linux system. While the tools, commands, and paths may be (slightly) different on your system the following steps provide a high level overview of the backup operation. Note Only use the following procedure as a guideline for a backup system and infrastructure. Production backup systems must consider a number of application specific requirements and factors unique to specific environments. Create a Snapshot To create a snapshot with LVM, issue a command as root in the following format: This command creates an LVM snapshot (with the --snapshot option) named mdb-snap01 of the mongodb volume in the vg0 volume group. This example creates a snapshot named mdb-snap01 located at /dev/vg0/mdb-snap01. The location and paths to your systems volume groups and devices may vary slightly depending on your operating system’s LVM configuration. The snapshot has a cap of at 100 megabytes, because of the parameter --size 100M. This size does not reflect the total amount of the data on the disk, but rather the quantity of differences between the current state of /dev/vg0/mongodb and the creation of the snapshot (i.e. /dev/vg0/mdb-snap01.) Warning Ensure that you create snapshots with enough space to account for data growth, particularly for the period of time that it takes to copy data out of the system or to a temporary image. If your snapshot runs out of space, the snapshot image becomes unusable. Discard this logical volume and create another. The snapshot will exist when the command returns. You can restore directly from the snapshot at any time or by creating a new logical volume and restoring from this snapshot to the alternate image. While snapshots are great for creating high quality backups very quickly, they are not ideal as a format for storing backup data. Snapshots typically depend and reside on the same storage infrastructure as the original disk images. Therefore, it’s crucial that you archive these snapshots and store them elsewhere. Archive a Snapshot After creating a snapshot, mount the snapshot and move the data to separate storage. Your system might try to compress the backup images as you move the offline. The following procedure fully archives the data from the snapshot: The above command sequence does the following: Ensures that the /dev/vg0/mdb-snap01 device is not mounted. Performs a block level copy of the entire snapshot image using the dd command and compresses the result in a gzipped file in the current working directory. Warning This command will create a large gz file in your current working directory. Make sure that you run this command in a file system that has enough free space. Restore a Snapshot To restore a snapshot created with the above method, issue the following sequence of commands: The above sequence does the following: Creates a new logical volume named mdb-new, in the /dev/vg0 volume group. The path to the new device will be /dev/vg0/mdb-new. Warning This volume will have a maximum size of 1 gigabyte. The original file system must have had a total size of 1 gigabyte or smaller, or else the restoration will fail. Change 1G to your desired volume size. Uncompresses and unarchives the mdb-snap01.gz into the mdb-new disk image. Mounts the mdb-new disk image to the /srv/mongodb directory. Modify the mount point to correspond to your MongoDB data file location, or other location as needed. Note The restored snapshot will have a stale mongod.lock file. If you do not remove this file from the snapshot, and MongoDB may assume that the stale lock file indicates an unclean shutdown. If you’re running with storage.journal.enabled enabled, and you do not use db.fsyncLock(), you do not need to remove the mongod.lock file. If you use db.fsyncLock() you will need to remove the lock. Restore Directly from a Snapshot To restore a backup without writing to a compressed gz file, use the following sequence of commands: Remote Backup Storage You can implement off-system backups using the combined process and SSH. This sequence is identical to procedures explained above, except that it archives and compresses the backup on a remote system using SSH. Consider the following procedure:Create Backups on Instances that do not have Journaling Enabled If your mongod instance does not run with journaling enabled, or if your journal is on a separate volume, obtaining a functional backup of a consistent state is more complicated. As described in this section, you must flush all writes to disk and lock the database to prevent writes during the backup process. If you have a replica set configuration, then for your backup use a secondary which is not receiving reads (i.e. hidden member). To flush writes to disk and to “lock” the database (to prevent further writes), issue the db.fsyncLock() method in the mongo shell: Perform the backup operation described in Create a Snapshot. To unlock the database after the snapshot has completed, use the following command in the mongo shell: Note Changed in version 2.0: MongoDB 2.0 added db.fsyncLock() and db.fsyncUnlock() helpers to the mongo shell. Prior to this version, use the fsync command with the lock option, as follows:"
    },
    { 
       "title": "Dancing",
       "body": "Good Morning America's Lara Spencer (left) poses with the 2014 DWTS cast: Standing: EMMA SLATER, BILLY DEE WILLIAMS, DANICA MCKELLAR, VALENTIN CHMERKOVSKIY, SEAN AVERY, CANDACE CAMERON BURE, MAKSIM CHMERKOVSKIY, MERYL DAVIS, NENE LEAKES, TONY DOVOLANI, SHARNA BURGESS, CHARLIE WHITE, CHERYL BURKE, DREW CAREY, DIANA NYAD, HENRY BYALIKOV, ERIN ANDREWS; Sitting: KARINA SMIRNOFF, DEREK HOUGH, MARK BALLAS, PETA MURGATROYD, JAMES MASLOW, WITNEY CARSON, CODY SIMPSON; Front: TOM BERGERON RELATED: See behind-the-scenes pics from the 2014 cast's first photo shoot» In a first for “Dancing with the Stars,” the competition will feature a new game changing twist called “The Switch Up.” This season, America will be given the power to vote and change celebrities and professional dance pairings. This new rule will affect all couples as they will be required to switch partners at a point in the season. Never before have dance partnerships been split up during the course of competition. PHOTOS: The Cast Announcement on Good Morning America» As announced this morning on ABC’s “Good Morning America” by “Dancing with the Stars” hosts Tom Bergeron and Erin Andrews, the 12 celebrities with their professional partners heading to the dance floor this season (in alphabetical order) are: SEAN AVERY -- Former pro hockey player Sean Avery is known for his unpredictable antics on the ice and a humorous personality. During his twelve year hockey career, he played left wing for the Detroit Red Wings, Los Angeles Kings, Dallas Stars, and the New York Rangers. Typically known as his team’s “enforcer,” Avery had a reputation as an outspoken agitator on (and sometimes off) the ice. Controversy followed him wherever he played, and he became known as much for his mercurial style of play as for his eclectic interests. These interests led Avery to many unique experiences including an internship at Vogue Magazine, working under the famed Anna Wintour and André Leon Talley. He has been featured in numerous ad campaigns as a model, including 7 For All Mankind and is currently the Luxury Advertising Director at Playboy. Also an activist, Avery is on the Board of Directors of Athlete Ally, a nonprofit raising awareness about homophobia and transphobia in sports. SEAN AVERY partners with KARINA SMIRNOFF.CANDACE CAMERON BURE -- Actress, producer, New York Times bestselling author and inspirational speaker, Candace Cameron Bure is both outspoken and passionate about her family and faith. Known to millions worldwide from her role as D.J. Tanner on the iconic family sitcom “Full House” Cameron Bure continues to flourish in the entertainment industry as role model to women of all ages. With an acting career that started at the age of five, Cameron Bure grew up in show business alongside her brother Kirk Cameron and has appeared in countless national television commercials, prime-time hits, TV movies and feature films. Mostly recently, Cameron Bure starred in the Hallmark Original Movie “Let It Snow.” In addition, she starred on ABC Family’s hugely popular show “Make It Or Break It” in a three year run as Summer Van Horn. Cameron Bure added bestselling author to her many titles with her book Reshaping It All: Motivation for Physical and Spiritual Fitness, inspiring women to embrace a healthier lifestyle by moving faith to the forefront of their relationship with food. Her second book, Balancing It All, shares her story of successfully balancing different roles and responsibilities including motherhood, work, and Hollywood. Cameron Bure and her husband, former NHL star Val Bure have been happily married since 1996. Together with their 3 children, Natasha, Lev and Maks, they split their time between Los Angeles and Napa Valley, California which is home to their boutique wine label, Bure Family Wines. CANDACE CAMERON BURE partners with MARK BALLAS.DREW CAREY -- Drew Carey is a stand-up comic turned actor and producer who had the distinction of having two hit shows simultaneously: the long-running comedy The Drew Carey Show, which ran from 1995-2004, and the improv/sketch show Whose Line Is It Anyway? on which he was host and a producer. The success of that show led to the creation of Drew Carey's Improv All-Stars, an improv troupe that performs in showrooms across the country. In July 2007, he was named the host of “The Price Is Right,” succeeding longtime host Bob Barker. He began his successful career as a comedian in April of 1986 at the Cleveland Comedy Club. In 1988, one of his first big breaks was competing on Star Search.” In 1991, Carey landed a spot on HBO's 14th Annual Young Comedians Special and appeared on The Tonight Show with Johnny Carson. Carey landed his own television development deal with Disney, which led to an opportunity for him to co-star in the series The Good Life. He also had the opportunity to work with Bruce Helford, who was a consulting writer on the series and hired him as a staff writer for The Gaby Hoffman Show. Their experience led the two of them to decide to co-create a series for Carey. He went on to star in his own comedy special for Showtime, Drew Carey: Human Cartoon and performed in Showtime's Tenth Anniversary of the Montreal Comedy Festival. Carey was born in Cleveland, Ohio and currently resides in Los Angeles. DREW CAREY partners with CHERYL BURKE. MERYL DAVIS -- Paired in 1997, Meryl Davis, 27, and her partner Charlie White, 26, are the longest-running ice dancing partnership in the history of United States figure skating. As a child, Davis wished to glide atop the frozen surface of the Michigan Lake adjacent to her home, so learning to ice skate at the age of five was a natural choice. They are 2014 Olympic Gold Medalists, 2010 Olympic Silver Medalists and 2011 & 2013 World Champions. Davis and White are also six-time (2009-2014) U.S. Champions, and five-time (2001-2013) Grand Prix Final Champions. Led by one of the most successful coaching teams in the world, she and White have steadily climbed the ranks of the U.S. and international ice dancing world. In 2006, they made their senior debut on the Grand Prix Series. They dominated the international skating scene this season, standing atop the podium at all six competitions they entered. By winning the 2013 World Championships, the team made figure skating history, becoming the only U.S. ice dancing team to ever win two World titles. The second title cemented their place in figure skating history and positioned them as the team to beat at the 2014 Olympic Winter Games in Sochi, Russia. When not on the ice Davis enjoys reading, traveling and learning about other cultures. She is currently a student at the University of Michigan. MERYL DAVIS partners with MAKSIM CHMERKOVSKIY. NENE LEAKES -- NeNe Leakes shot to stardom as a fan favorite on Bravo’s “Real Housewives of Atlanta.” Her popularity as a housewife led to her own Bravo television series “I Dream of Nene: The Wedding.” In 2012, she was cast as coach Roz Washington on “Glee” and later that year landed a starring role on NBC’s sitcom “The New Normal.” Leakes has also guest-starred in BET comedies, “The Game” and “Let’s Stay Together.” She was voted as one of Entertainment Weekly’s Entertainers of the Year and was the recipient of Bravo’s A-list Award for Fan Favorite. She is the author of Never Make the Same Mistake Twice, discussing her fractured childhood, abusive relationship and struggles with being a single mother. Currently, Leakes resides in Duluth, Ga., a suburb of Atlanta, along with her two children and husband Gregg Leakes. NENE LEAKES partners with TONY DOVOLANI. JAMES MASLOW -- James Maslow is best known as the star of the hit television series “Big Time Rush” and as a member of the worldwide bestselling music group of the same name. Maslow has headlined sold out tours across the globe, most recently the Big Time Rush Live 2014 World Tour, performing at some of the largest venues across North & South America. Maslow began his acting career on the popular series “iCarly” and completed the fourth season of “Big Time Rush” last year. As one of the most popular music groups internationally, Big Time Rush has won countless Kids’ Choice Awards, and a 2012 Parade Magazine poll named Big Time Rush the “Best Boy Band in the World,” topping other well-known bands such as One Direction and The Wanted. Maslow has collaborated with many popular recording artists, such as Jordin Sparks, Ryan Tedder of OneRepublic and with Snoop Dogg on Big Time Rush’s international, chart-topping hit single “Boyfriend.” Born in New York and raised in San Diego, Maslow began performing at an early age, training at the prestigious La Jolla Playhouse, San Diego School of Creative and Performing Arts, and the Coronado School of the Arts. JAMES MASLOW partners with PETA MURGATROYD. DANICA MCKELLAR -- Danica McKellar, best known as Winnie Cooper on “The Wonder Years” and Elsie Snuffin on “The West Wing,” is a New York Times bestselling author with her groundbreaking books, Math Doesn’t Suck, Kiss My Math, Hot X: Algebra Exposed and Girls Get Curves: Geometry Takes Shape. A summa cum laude graduate of UCLA, McKellar wrote a theorem that has been dubbed, “The Chayes-McKellar-Winn Theorem,” and was published in Britain’s esteemed Journal of Physics. Upon the release of Math Doesn’t Suck, Danica was celebrated as “Person of the Week” on The World News with Charles Gibson for her advocacy of girls’ math education and being a positive role model for young girls. Danica also encourages a healthy balanced lifestyle, a part of that being yoga. To that end she has a DVD “Daily Dose of Dharma with Danica McKellar.” Her recent acting roles include appearances on “How I Met Your Mother” and “The Big Bang Theory”, voicing the regular role of Miss Martian on Cartoon Network’s “Young Justice”, and starring roles in Lifetime movies “Love at the Christmas Table” and most recently “The Wrong Woman.” Recently Danica created a sensation with  her risqué  guest cameo in the hit Avril Lavigne video “Rock and Roll.” Despite Danica’s busy schedule, she finds time to lend a helping hand to worthwhile organizations, especially anything relating to children and/or education.  She is a spokesperson for St. Jude Children’s Hospital’s Math-a-thon, is involved with the Brigitte and Bobby Sherman Children’s Foundation which provides at risk children in Ghana with food, clothing, healthcare and education; andthe California-based My Stuff Bags Foundation, which provides powerful advocacy on behalf of abused, abandoned and neglected children across the U.S. and Canada.   Danica has a 3 year old son, Draco: the love of her life. DANICA MCKELLAR partners with VALENTIN CHMERKOVSKIY.DIANA NYAD -- 25 million people worldwide rooted for Diana Nyad last September as she approached the Florida shore, at long last achieving her 35-year-old dream of becoming the first person to swim from Cuba to Florida. Nyad is not one to quit. On her fifth attempt, speaking the words “Never Ever Give Up” to the wildly cheering crowd on a Key West beach on September 2, 2013, Nyad may have been dazed and physically spent, but she showed the world what persistence and belief can manifest. Nyad stroked the amazing 110.86 miles in 52 hours, 54 minutes, 18 seconds. Daring to reach for the stars, this swim beginning to seem impossible (after her four attempts and other strong swimmers trying and failing since 1950), Nyad has motivated the world at large to be bold, to live fearlessly, to chase one’s dreams with unwavering commitment. The second statement the victorious 64-year-old made on that Key West beach? “You’re never too old to chase your dreams.” And her third statement on that historic day: “It looks a solitary sport, but it’s a TEAM.” A prominent sports broadcaster, reporting for National Public Radio, Fox Sports, ABC’s Wide World of Sports, The New York Times for thirty years, Nyad has carved her place as one of our compelling story-tellers. She has written three books and is currently writing her memoir for Knopf, due out in 2015. Nyad is a talented linguist, speaking three foreign languages fluently. She has also earned the reputation of a uniquely entertaining and inspiring public speaker. DIANA NYAD joins first time professional partner HENRY BYALIKOV.  AMY PURDY -- Amy Purdy had a typical childhood until losing her legs at 19 as a result of Meningitis, which has led to an adulthood of extraordinary accomplishments. Currently training for the 2014 Paralympic Games in Sochi, Russia she is the top ranked adaptive snowboarder in the U.S. and three-time World Cup Para-snowboard winner. Purdy is the Co-Founder of Adaptive Action Sports, a non-profit organization which helps disabled youth, adults and wounded veterans get involved in action sports. AAS was instrumental in getting adaptive snowboarding added to the 2014 Paralympic Games. Purdy’s positive outlook has opened many doors to other opportunities including being featured in a Madonna music video, a lead acting role in an award winning independent film and multiple modeling projects. She is an accomplished motivational speaker who has shared her story with audiences around the world. In 2013, Purdy was named by the International Olympic Committee as one of the top 15 most marketable Para-athletes in the world.  AMY PURDY partners with DEREK HOUGH. CODY SIMPSON -- With over 6.4 million Twitter followers, over 6.7 million Facebook likes and nearly 200 million YouTube views, 17-year-old pop star Cody Simpson has taken the world by storm. Simpson recently released “The Acoustic Sessions” EP that followed the release of his sophomore album, 2013’s “Surfers Paradise” that debuted top 10 on the Billboard 200 chart and features the Top 40 hit single “Pretty Brown Eyes.” He recently wrapped his sold out US and Canadian Acoustic Sessions Tour and had previously been touring with Justin Bieber on Bieber’s Believe Tour. In 2013, Simpson released his first book Welcome To Paradise: My Journey published by HarperCollins. CODY SIMPSON joins first time professional partner WITNEY CARSON. CHARLIE WHITE -- Paired in 1997, Charlie White, 26, and his partner Meryl Davis 27, are the longest-running ice dancing partnership in the history of United States figure skating. White, who grew up just down the street from his partner began skating at the age of three. They are 2014 Olympic Gold Medalists, 2010 Olympic Silver Medalists and 2011 & 2013 World Champions. White and Davis are also six-time (2009-2014) U.S. Champions, and five-time (2001-2013) Grand Prix Final Champions. Led by one of the most successful coaching teams in the world, they have steadily climbed the ranks of the U.S. and international ice dancing world. In 2006, they made their senior debut on the Grand Prix Series. They dominated the international skating scene this season, standing atop the podium at all six competitions they entered. By winning the 2013 World Championships, the team made figure skating history, becoming the only U.S. ice dancing team to ever win two World titles. The second title cemented their place in figure skating history and positioned them as the team to beat at the 2014 Olympic Winter Games in Sochi, Russia. White is an avid sports fan, particularly hockey. An accomplished hockey player himself, White was part of a State Championship-winning team. Believing education is important, he is currently a student at the University of Michigan and hopes to attend law school in the future. CHARLIE WHITE partners with SHARNA BURGESS. BILLY DEE WILLIAMS -- Legendary leading man, Billy Dee Williams, was often touted as the 'black Clark Gable,' especially after his co-starring role in “Lady Sings the Blues,” opposite Diana Ross. George Lucas tapped him to play the scoundrel Lando Calrissian in “The Empire Strikes Back,” and “The Return of the Jedi.” He also played the district attorney Harvey Dent in 1989's “Batman.”  Williams many films include “The Ladies Man,” “Undercover Brother,” “The Visit,” “Fanboys,” “Barry Munday” and “Constellation” opposite Gabrielle Union. Most recently, the iconic Williams appeared in the blockbuster film “The Lego Movie.” In 2006, the NAACP recognized Williams for his immense contribution to the arts by awarding him the Lifetime Achievement Award.  His television appearances include “Lost,” “Private Practice” and “Scrubs.” In addition to his impressive acting career, Williams is also a very accomplished artist and has a painting on display at the Smithsonian. BILLY DEE WILLIAMS partners with EMMA SLATER. Viewers may cast their votes for their favorite teams via phone on Monday nights during and up to 60 minutes after the end of the “Dancing with the Stars” broadcast in each time zone. Online voting at www.ABC.com and on Facebook at https://apps.facebook.com/votedwts/ is open for 24 hours, beginning from the start of each episode on the East Coast at 8:00 p.m., ET/5:00 p.m., PT and closing at 8:00 p.m., ET/5:00 p.m., PT on Tuesday evenings. For the final week, on Monday, May 19, online voting will open for 15 hours, beginning from the start of the episode on the East Coast at 8:00 p.m., ET/5:00 p.m., PT and closing at 11:00 a.m., ET/8:00 a.m., PT the next day. A custom Facebook app lets fans vote, share whom they voted for and say why, as well as see whom friends voted for. Hosted by Emmy® Award-winning host Tom Bergeron (“America’s Funniest Home Videos”) and Erin Andrews (sports host & “Dancing with the Stars” Season 10 finalist), “Dancing with the Stars” is the hit series in which celebrities perform choreographed dance routines which are judged by renowned ballroom judge Len Goodman and dancer/choreographers Bruno Tonioli and Carrie Ann Inaba."
    },
    { 
       "title": "Original Wikipedia entry",
       "body": "In information technology, a backup, or the process of backing up, refers to the copying and archiving of computer data so it may be used to restore the original after a data loss event. The verb form is to back up in two words, whereas the noun is backup.[1] Backups have two distinct purposes. The primary purpose is to recover data after its loss, be it by data deletion or corruption. Data loss can be a common experience of computer users. A 2008 survey found that 66% of respondents had lost files on their home PC.[2] The secondary purpose of backups is to recover data from an earlier time, according to a user-defined data retention policy, typically configured within a backup application for how long copies of data are required. Though backups popularly represent a simple form of disaster recovery, and should be part of a disaster recovery plan, by themselves, backups should not alone be considered disaster recovery.[3] One reason for this is that not all backup systems or backup applications are able to reconstitute a computer system or other complex configurations such as a computer cluster, active directory servers, or a database server, by restoring only data from a backup. Since a backup system contains at least one copy of all data worth saving, the data storage requirements can be significant. Organizing this storage space and managing the backup process can be a complicated undertaking. A data repository model can be used to provide structure to the storage. Nowadays, there are many different types of data storage devices that are useful for making backups. There are also many different ways in which these devices can be arranged to provide geographic redundancy, data security, and portability. Before data are sent to their storage locations, they are selected, extracted, and manipulated. Many different techniques have been developed to optimize the backup procedure. These include optimizations for dealing with open files and live data sources as well as compression, encryption, and de-duplication, among others. Every backup scheme should include dry runs that validate the reliability of the data being backed up. It is important to recognize the limitations and human factors involved in any backup scheme."
    },
    { 
       "title": "Five reliable Windows Server backup solutions",
       "body": "Five reliable Windows Server backup solutions By Jack Wallen in Five Apps, February 20, 2012, 12:27 AM PST When disaster strikes (and it will), you can put the pieces back together if you've got a solid backup solution in place. If you have a Windows server and you're not backing it up, you are tempting fate. It's only a matter of time before something tragic will happen: a hardware failure, a hacker, or a corrupted Windows update. Something will bring that server down and do everything it can to take your data with it.Luckily, several reliable backup solutions are available for the Windows Server environment. They aren't perfect. But the five solutions discussed here have their strengths and can be depended upon to keep your data safe. Now, before I reveal the big five, I want to make sure you understand how critical it is to be backing up that data to an external drive and to rotate that drive offsite. If you're backing up drives and leaving everything onsite, should a fire (or some other catastrophe) occur, that data will be lost.  Acronis Backup and Restore (Figure A) is the backup tool I use the most. It's costly but well worth it. The newer version of Acronis does a great job of ensuring that there is room on your external drive for your latest backup. You can overwrite the old backup or go by the traditional cleanup rules established in Acronis Echo. But if you go the Acronis route, you should also purchase the Universal Restore feature. With this tool, you can take a full image of a backup and restore it to any hardware -- so long as it meets the requirements of your platform. That way, you don't need an exact duplicate of your server hardware sitting around waiting to have an image restored onto it. Acronis also has add-ons for Exchange and SQL Servers. Acronis Backup and Restore 2: Symantec Backup Exec Symantec Backup Exec (Figure B) is a powerful backup solution that does a great job of just working. And with its at-a-glance calendar, it's easy to know when your backup has succeeded and when it has worked. If you're using Symantec Backup Exec across a network (to back up clients/hosts), you can feel safe because it uses SSL for all network backup connections. Like Acronis, Symantec offers solutions for Exchange and SQL. Also, the ability to manage Vaults (backup destinations) is superb with Symantec. Just make sure that if a Vault is physically (and permanently) removed, you remove it from within the backup software. Otherwise, it will cause problems. Symantec Backup Exec Carbonite (Figure C) is primarily an online backup (although the Business and BusinessPremier plans allow you to back up to an external drive). It's meant to back up data only. Carbonite is probably one of the most reliable online backup tools and can back up email, documents, POS files, financial data, pictures and other multimedia, and more. But to use Carbonite for Windows Server, you must use the BusinessPremier Plan ($229.00 per year), which will allow you to include as many servers running Window Server 2003/2008/2011 as you like. Unlike Acronis, you won't be backing up an image of your server with Carbonite -- it's a data-only backup tool. But it's an excellent addition to any onsite backup solution. Carbonite 4: Windows NT Backup Windows NT Backup (Figure D) is the free backup solution that comes with any Windows Server. Why do I include it here? Although it just does data backup and doesn't offer many of the bells and whistles of the other tools, it is one of the only truly reliable backup solutions that will clear the Exchange logs for you. I always set up an NT Backup to run once a week (or month, depending upon the needs), just to have it clear the Exchange logs. Otherwise, you'll be including a lot of unnecessary data in your backups, causing their size to get out of hand. Figure D Windows NT Backup 5: ShadowProtect 4 (Server) ShadowProtect 4 (Figure E) is probably the least-known product in this list. But it falls into place next to Acronis as a feature-rich tool that can do everything -- including recover to dissimilar hardware. ShadowProtect 4 also includes an easy-to-use tool that allows you to consolidate backup image files and convert the backups to either .VHD or .VMDK virtual machines. Another outstanding feature is its granular recovery, which allows for the quick recovery of individual files from within a backup. Unique to ShadowProtect is the Virtual Boot technology, which provides for automatic failover to a virtual server. Every company needs a backup plan. How far you go with your backup depends upon the size of the company, your needs, and your budget. But any of the above solutions will serve as a great place to start -- or stop -- for your Windows Server backup needs. Do you have a different backup solution to add to the list? Share your recommendations with fellow TechRepublic members."
    },
    {
       "title" : "Data consistency",
       "body" : "Point-in-time consistency is an important property of backup files and a critical objective of software that creates backups. It is also relevant to the design of disk memory systems, specifically relating to what happens when they are unexpectedly shut down. As a relevant backup example, consider a website with a database such as the online encyclopedia Wikipedia, which needs to be operational around the clock, but also must be backed up with regularity to protect against disaster. Portions of Wikipedia are constantly being updated every minute of every day, meanwhile, Wikipedia's database is stored on servers in the form of one or several very large files which require minutes or hours to back up. These large files - as with any database - contain numerous data structures which reference each other by location. For example, some structures are indexes which permit the database subsystem to quickly find search results. If the data structures cease to reference each other properly, then the database can be said to be corrupted. Counter example The importance of point-in-time consistency can be illustrated with what would happen if a backup were made without it. Assume Wikipedia's database is a huge file, which has an important index located 20% of the way through, and saves article data at the 75% mark. Consider a scenario where an or comes and creates a new article at the same time a backup is being performed, which is being made as a simple file copy which copies from the beginning to the end of the large file(s) and doesn't consider data consistency - and at the time of the article , it is 50% complete. The new article is added to the article space (at the 75% mark) and a corresponding index entry is added (at the 20% mark). Because the backup is already halfway done and the index already copied, the backup will be written with the article data present, but with the index reference missing. As a result of the inconsistency, this file is considered corrupted. In real life, a real database such as Wikipedia's may be ed thousands of times per hour, and references are virtually always spread throughout the file and can number into the millions, billions, or more. A sequential copy backup would literally contain so many small corruptions that the backup would be completely unusable without a lengthy repair process which could provide no guarantee as to the completeness of what has been recovered. A backup process which properly accounts for data consistency ensures that the backup is a snapshot of how the entire database looked at a single moment. In the given Wikipedia example, it would ensure that the backup was written without the added article at the 75% mark, so that the article data would be consistent with the index data previously written. Disk caching systems Point-in-time consistency is also relevant to computer disk subsystems. Specifically, operating systems and file systems are designed with the expectation that the computer system they are running on could lose power, crash, fail, or otherwise cease operating at any time. When properly designed, they ensure that data will not be unrecoverably corrupted if the power is lost. Operating systems and file systems do this by ensuring that data is written to a hard disk in a certain order, and rely on that in order to detect and recover from unexpected shutdowns. On the other hand, rigorously writing data to disk in the order that maximizes data integrity also impacts performance. A process of write caching is used to consolidate and re-sequence write operations such that they can be done faster by minimizing the time spent moving disk heads. Data consistency concerns arise when write caching changes the sequence in which writes are carried out, because it there exists the possibility of an unexpected shutdown that violates the operating system's expectation that all writes will be committed sequentially. For example, in order to save a typical document or picture file, an operating system might write the following records to a disk in the following order: Journal entry saying file XYZ is about to be saved into sector 123. The actual contents of the file XYZ are written into sector 123. Sector 123 is now flagged as occupied in the record of free/used space. Journal entry noting the file completely saved, and its name is XYZ and is located in sector 123. The operating system relies on the assumption that if it sees item #1 is present (saying the file is about to be saved), but that item #4 is missing (confirming success), that the save operation was unsuccessful and so it should undo any incomplete steps already taken to save it (e.g. marking sector 123 free since it never was properly filled, and removing any record of XYZ from the file directory). It relies on these items being committed to disk in sequential order. Suppose a caching algorithm determines it would be fastest to write these items to disk in the order 4-3-1-2, and starts doing so, but the power gets shut down after 4 get written, before 3, 1 and 2, and so those writes never occur. When the computer is turned back on, the file system would then show it contains a file named XYZ which is located in sector 123, but this sector really does not contain the file. (Instead, the sector will contain garbage, or zeroes, or a random portion of some old file - and that is what will show if the file is opened). Further, the file system's free space map will not contain any entry showing that sector 123 is occupied, so later, it will likely assign that sector to the next file to be saved, believing it is available. The file system will then have two files both unexpectedly claiming the same sector (known as a cross-linked file). As a result, a write to one of the files will overwrite part of the other file, invisibly damaging it. A disk caching subsystem that ensures point-in-time consistency guarantees that in the event of an unexpected shutdown, the four elements would be written one of only five possible ways: completely (1-2-3-4), partially (1, 1-2, 1-2-3), or not at all. High-end hardware disk controllers of the type found in servers include a small battery back-up unit on their cache memory so that they may offer the performance gains of write caching while mitigating the risk of unintended shutdowns. The battery back-up unit keeps the memory powered even during a shutdown so that when the computer is powered back up, it can quickly complete any writes it has previously committed. With such a controller, the operating system may request four writes (1-2-3-4) in that order, but the controller may decide the quickest way to write them is 4-3-1-2. The controller essentially lies to the operating system and reports that the writes have been completed in order (a lie that improves performance at the expense of data corruption if power is lost), and the battery backup hedges against the risk of data corruption by giving the controller a way to silently fix any and all damage that could occur as a result. If the power gets shut off after element 4 has been written, the battery backed memory contains the record of commitment for the other three items and ensures that they are written (flushed) to the disk at the next available opportunity. Transaction consistency Transaction consistency is also frequently referred to as atomicity. A good example of the importance of transaction consistency is a database that handles the transfer of money. Suppose a money transfer requires two operations: writing a debit in one place, and a cr in another. If the system crashes or shuts down when one operation has completed but the other has not, and there is nothing in place to correct this, the system can be said to lack transaction consistency. With a money transfer, it is desirable that either the entire transaction completes, or none of it completes. Both of these scenarios keep the balance in check. Transaction consistency ensures just that - that a system is programmed to be able to detect incomplete transactions when powered on, and undo (or roll back) the portion of any incomplete transactions that are found."
    }
  ]
}
